sdaiCreateIterator(Sdai_Id_aggr*)
\details
Creates an iterator for traversing through the aggregate elements.
\param aggregate [in] An aggregate for traversing.
\returns An iterator object.
\remarks
The iterator object created by the function should be deleted by the user when he does not need it anymore.